Masmiseim36/nxpSDK/devices/MIMXRT1175/drivers/fsl_caam.c
    algState     = kCAAM_AlgStateInitFinal;
    uint32_t num = caam_hash_sgt_insert(NULL,             /* no ctxInternal data to pre-pend before input data chunk */
                                        input, inputSize, /* data and size in bytes */
                                        NULL, /* all data is processed during kCAAM_AlgStateInitFinal, nothing remain */
                                        algState, sgt, kCAAM_HashSgtEntryLast); /* sgt table, entry 0 word 0 */

    /* schedule the request at CAAM */
    status = caam_hash_schedule_input_data(base, handle, algo, sgt, num, kCAAM_HashSgtInternal, algState, descriptor,
                                           outputSize, output, NULL, (uint32_t)key, keySize);
    return status;
}
/*******************************************************************************
 * CRC Code static
 ******************************************************************************/
static status_t caam_crc_check_input_alg(caam_crc_algo_t algo)
{
    if ((algo != kCAAM_CrcIEEE) && (algo != kCAAM_CrciSCSI) && (algo != kCAAM_CrcCUSTPOLY))
    {
        return kStatus_InvalidArgument;
    }
    return kStatus_Success;
}

static inline bool caam_crc_alg_is_customcrc(caam_crc_algo_t algo)
{
    return (algo == kCAAM_CrcCUSTPOLY);
}

static status_t caam_crc_check_input_args(
    CAAM_Type *base, caam_hash_ctx_t *ctx, caam_crc_algo_t algo, const uint8_t *polynomial, size_t polynomialSize)
{
    /* Check validity of input algorithm */
    if (kStatus_Success != caam_crc_check_input_alg(algo))
    {
        return kStatus_InvalidArgument;
    }

    if ((NULL == ctx) || (NULL == base))
    {
        return kStatus_InvalidArgument;
    }

    if (caam_crc_alg_is_customcrc(algo))
    {
        if ((NULL == polynomial) && ((polynomialSize > 4u) || (polynomialSize < 1u)))
        {
            return kStatus_InvalidArgument;
        }
    }

    return kStatus_Success;
}

static status_t caam_crc_check_context(caam_crc_ctx_internal_t *ctxInternal, const uint8_t *data)
{
    if ((NULL == data) || (NULL == ctxInternal) || (NULL == ctxInternal->base) ||
        (kStatus_Success != caam_crc_check_input_alg(ctxInternal->algo)))
    {
        return kStatus_InvalidArgument;
    }
    return kStatus_Success;
}

static uint32_t caam_crc_algo2mode(caam_crc_algo_t algo, uint32_t crcMode, uint32_t algState)
{
    uint32_t modeReg = 0u;

    /* Set CAAM algorithm */
    switch (algo)
    {
        case kCAAM_CrcIEEE:
            modeReg = (uint32_t)kCAAM_AlgorithmCRC | (uint32_t)kCAAM_CRC_ModeIEEE802;
            break;
        case kCAAM_CrciSCSI:
            modeReg = (uint32_t)kCAAM_AlgorithmCRC | (uint32_t)kCAAM_CRC_ModeIETF3385;
            break;
        case kCAAM_CrcCUSTPOLY:
            modeReg = (uint32_t)kCAAM_AlgorithmCRC | crcMode | (uint32_t)kCAAM_CRC_ModeCUSTPOLY;
            break;
        default:
            /* All the cases have been listed above, the default clause should not be reached. */
            break;
    }

    modeReg |= algState;

    return modeReg;
}

/*!
 * @brief Add data chunk to SGT table. Append after uncomplete block in ctxInternal if there is any.
 *
 * @param ctxInternal uncomplete block in the crc context - to be inserted before new data chunk
 * @param input new data chunk to insert
 * @param inputSize size in bytes of new data chunk to insert
 * @param numRemain number of bytes that remain in the last uncomplete block
 * @param algState in FINALIZE or INITIALIZE/FINALIZE we add also last uncomplete block bytes
 * @param sgt address of the SGT
 * @param last last call to this function adds Final Bit
 */
static uint32_t caam_crc_sgt_insert(caam_crc_ctx_internal_t *ctxInternal,
                                    const uint8_t *input,
                                    size_t inputSize,
                                    size_t *numRemain,
                                    caam_algorithm_state_t algState,
                                    caam_sgt_entry_t *sgt,
                                    caam_hash_sgt_entry_type_t last)
{
    /* configure SGT
     * *64 bytes multiple in kCAAM_HashInit or kCAAM_HashUpdate
     * *arbitrary amount of data in kCAAM_HashInitFinal or kCAAM_HashFinal
     * min 1 and max 2 SGT entries
     * 1) if there is any data in the context buffer, use it as one entry
     * 2) input as one entry
     */
    uint32_t numBlocks;
    uint32_t remain;
    uint32_t num;
    uint32_t currSgtEntry;

    uint32_t ctxBlksz   = (ctxInternal != NULL) ? ctxInternal->blksz : 0U;
    uint32_t ctxBlkAddr = (ctxInternal != NULL) ? (uint32_t)&ctxInternal->blk.b[0] : 0U;

    currSgtEntry = 0;
    numBlocks    = (inputSize + ctxBlksz) / CAAM_HASH_BLOCK_SIZE;
    remain       = (inputSize + ctxBlksz) % CAAM_HASH_BLOCK_SIZE;

    /* number of bytes for processing
     * only full block multiple in INITIALIZE or UPDATE
     * any size in INITIALIZE/FINALIZE or FINALIZE
     */
    num = (CAAM_HASH_BLOCK_SIZE * numBlocks);
    if ((algState == kCAAM_AlgStateInitFinal) || (algState == kCAAM_AlgStateFinal))
    {
        num += remain; /* add also uncomplete bytes from last block in one of FINALIZE states */
        remain = 0;
    }
    if (numRemain != NULL)
    {
        *numRemain = remain;
    }

    if ((ctxBlksz != 0U) || (0U == ctxBlksz + inputSize))
    {
        sgt[currSgtEntry].address_l = ADD_OFFSET(ctxBlkAddr);
        sgt[currSgtEntry].length    = ctxBlksz;
        if ((kCAAM_HashSgtEntryLast == last) && (0U == inputSize))
        {
            sgt[currSgtEntry].length |= 0x40000000u; /* Final SG entry */
        }
        currSgtEntry++;
    }

    if (inputSize != 0U)
    {
        /* number of bytes for processing
         * only full block multiple in INITIALIZE or UPDATE
         * any size in INITIALIZE/FINALIZE or FINALIZE
         */
        sgt[currSgtEntry].address_l = ADD_OFFSET((uint32_t)input);
        sgt[currSgtEntry].length    = inputSize - remain;
        if (kCAAM_HashSgtEntryLast == last)
        {
            sgt[currSgtEntry].length |= 0x40000000u; /* Final SG entry */
            sgt[currSgtEntry].offset = 0x80000000u;
        }
    }
    return num; /* no of bytes processed in total by these 1 or 2 SGT entries */
}

/*!
 * @brief Create job descriptor for the CRC request and schedule at CAAM job ring
 *
 *
 */
static status_t caam_crc_schedule_input_data(CAAM_Type *base,
                                             caam_handle_t *handle,
                                             caam_crc_algo_t algo,
                                             caam_aai_crc_alg_t crcMode,
                                             caam_sgt_entry_t *sgt,
                                             uint32_t dataSize,
                                             caam_hash_sgt_type_t sgtType,
                                             caam_algorithm_state_t algState,
                                             caam_desc_hash_t descriptor,
                                             size_t *outputSize,
                                             void *output,
                                             void *context,
                                             uint32_t polynomialAddr,
                                             uint32_t polynomialSize)
{
    BUILD_ASSURE(sizeof(templateHash) <= sizeof(caam_desc_hash_t), caam_desc_hash_t_size);
    uint32_t descriptorSize = ARRAY_SIZE(templateHash);
    uint32_t algOutSize     = 4u;

    bool isCustomCRC = caam_crc_alg_is_customcrc(algo);

    /* MDHA use of the Context Register
        The Context Register stores the current digest and running message length. The running
        message length will be 8 bytes immediately following the active digest. The digest size is
        defined as follows:
 CRC: 4 bytes so caamCtxSz = 8 +4 */
    uint32_t caamCtxSz = 12u;

    (void)caam_memcpy(descriptor, templateHash, sizeof(templateHash));

