Masmiseim36/nxpSDK/devices/MIMXRT1175/drivers/fsl_caam.c
/*******************************************************************************
 * Key blob Code public
 ******************************************************************************/

static const uint32_t templateBlob[] = {
    /* 00 */ 0xB0800000u, /* HEADER */
    /* 01 */ 0x04000000u, /* KEY command to Class 2 Context Register, 64/128bits RNG KEY. */
    /* 02 */ 0x00000000u, /* place: a pointer to the key to be loaded */
    /* 03 */ 0xF0000000u, /* SEQ IN PTR command to load plain data or key blob depending on operation */
    /* 04 */ 0x00000000u, /* place: a pointer to plain data/ key blob to be loaded */
    /* 05 */ 0xF8000000u, /* SEQ OUT PTR command to store blob datas */
    /* 06 */ 0x00000000u, /* place: a pointer to blob data or plain data to be stored depending on operation*/
    /* 07 */ 0x800D0000u, /* OPERATION:Encrypt/Decrypt BLOB  */
};

/*!
 * brief Construct a encrypted Red Blob
 *
 * This function constructs a job descriptor capable of performing
 * a encrypted blob operation on a plaintext object.
 *
 * param base CAAM peripheral base address
 * param handle Handle used for this request. Specifies jobRing.
 * param keyModifier Address of the random key modifier generated by RNG
 * param keyModifierSize Size of keyModifier buffer in bytes
 * param data Data adress
 * param dataSize Size of the buffer pointed by the data parameter
 * param[out] blob_data Output blob data adress
 * return Status of the request
 */
status_t CAAM_RedBlob_Encapsule(CAAM_Type *base,
                                caam_handle_t *handle,
                                const uint8_t *keyModifier,
                                size_t keyModifierSize,
                                const uint8_t *data,
                                size_t dataSize,
                                uint8_t *blob_data)
{
    status_t status = kStatus_Fail;

    caam_desc_gen_enc_blob_t descriptor;
    size_t blob_size;

    /* output blob will have 32 bytes key blob in beginning and 16 bytes MAC identifier at end of data blob */
    blob_size = 32u + dataSize + 16u;

    /* Key modifier size must 8 bytes long when used Secure memory or 16bytes long when General memory is used*/
    if ((keyModifierSize != 8u) && (keyModifierSize != 16u))
    {
        return kStatus_InvalidArgument;
    }

    /* create job descriptor */
    BUILD_ASSURE(sizeof(templateBlob) <= sizeof(caam_desc_gen_enc_blob_t), caam_desc_gen_enc_blob_t_size);
    uint32_t descriptorSize = ARRAY_SIZE(templateBlob);
    (void)caam_memcpy(descriptor, templateBlob, sizeof(templateBlob));
    descriptor[0] |= (descriptorSize & DESC_SIZE_MASK);
#if defined(KEYBLOB_USE_SECURE_MEMORY)
    descriptor[1] |= 8u; // KEY command to Class 2 Context Register,  64bits RNG KEY.
#else
    descriptor[1] |= 16u;         // KEY command to Class 2 Context Register, 128bits RNG KEY.
#endif                                                 /* (KEYBLOB_USE_SECURE_MEMORY) */
    descriptor[2] = ADD_OFFSET((uint32_t)keyModifier); // Key modifier adress
    descriptor[3] |= dataSize;                         // SEQ IN PTR command to load plain data
    descriptor[4] = ADD_OFFSET((uint32_t)data);        // Plain data adress
    descriptor[5] |= blob_size;                        // SEQ OUT PTR Set outputing key blob
    descriptor[6] = ADD_OFFSET((uint32_t)blob_data);   // Key blob adress
#if defined(KEYBLOB_USE_SECURE_MEMORY)
    descriptor[7] |= (7UL << 24) | SEC_MEM; // OPERATION:Encrypt Red Blob in secure memory
#else
    descriptor[7] |= (7UL << 24); // OPERATION:Encrypt Red Blob in normal memory
#endif /* (KEYBLOB_USE_SECURE_MEMORY) */

    // schedule the job and block wait for result
    do
    {
        status = caam_in_job_ring_add(base, handle->jobRing, &descriptor[0]);
    } while (status == kStatus_CAAM_Again);

    if (kStatus_Success != status)
    {
        return status;
    }

    status = CAAM_Wait(base, handle, descriptor, kCAAM_Blocking);
#if defined(CAAM_OUT_INVALIDATE) && (CAAM_OUT_INVALIDATE > 0u)
    /* NOTE: DCACHE must be set to write-trough mode to safely invalidate cache!! */
    /* Invalidate unaligned data can cause memory corruption in write-back mode   */
    DCACHE_InvalidateByRange((uint32_t)blob_data, blob_size);
#endif /* CAAM_OUT_INVALIDATE */
    return status;
}

/*! brief Decrypt red blob
 *
 * This function constructs a job descriptor capable of performing
 * decrypting red blob.
 *
 * param base CAAM peripheral base address
 * param handle Handle used for this request. Specifies jobRing.
 * param keyModifier Address of the random key modifier generated by RNG
 * param keyModifierSize Size of keyModifier buffer in bytes
 * param blob_data Address of blob data
 * param[out] data Output data adress.
 * param dataSize Size of the buffer pointed by the data parameter in bytes
 * return Status of the request
 */

status_t CAAM_RedBlob_Decapsule(CAAM_Type *base,
                                caam_handle_t *handle,
                                const uint8_t *keyModifier,
                                size_t keyModifierSize,
                                const uint8_t *blob_data,
                                uint8_t *data,
                                size_t dataSize)
{
    status_t status = kStatus_Fail;

    size_t blob_size;
    caam_desc_gen_dep_blob_t descriptor;

    /* blob have 32 bytes key blob in beginning and 16 bytes MAC identifier at end of data blob */
    blob_size = 32u + dataSize + 16u;

    /* Key modifier size must 8 bytes long when used Secure memory or 16bytes long when General memory is used*/
    if ((keyModifierSize != 8u) && (keyModifierSize != 16u))
    {
        return kStatus_InvalidArgument;
    }

    /* create job descriptor */

    BUILD_ASSURE(sizeof(templateBlob) <= sizeof(caam_desc_gen_dep_blob_t), caam_desc_gen_dep_blob_t_size);
    uint32_t descriptorSize = ARRAY_SIZE(templateBlob);

    (void)caam_memcpy(descriptor, templateBlob, sizeof(templateBlob));
    descriptor[0] |= (descriptorSize & DESC_SIZE_MASK);
#if defined(KEYBLOB_USE_SECURE_MEMORY)
    descriptor[1] |= 8u; // KEY command to Class 2 Context Register, 64bits RNG KEY.
#else
    descriptor[1] |= 16u;         // KEY command to Class 2 Context Register, 128bits RNG KEY.
#endif                                                 /* (KEYBLOB_USE_SECURE_MEMORY) */
    descriptor[2] = ADD_OFFSET((uint32_t)keyModifier); // Key modifier adress
    descriptor[3] |= blob_size;                        // SEQ IN PTR command to load blob data
    descriptor[4] = ADD_OFFSET((uint32_t)blob_data);   // Key blob adress
    descriptor[5] |= dataSize;                         // SEQ OUT PTR command to load plain data
    descriptor[6] = ADD_OFFSET((uint32_t)data);        // Plain data adress
#if defined(KEYBLOB_USE_SECURE_MEMORY)
    descriptor[7] |= (6UL << 24) | SEC_MEM; // OPERATION:Decrypt red blob in secure memory
#else
    descriptor[7] |= (6UL << 24); // OPERATION:Decrypt red blob in normal memory
#endif /* (KEYBLOB_USE_SECURE_MEMORY) */
    // schedule the job and block wait for result
    do
    {
        status = caam_in_job_ring_add(base, handle->jobRing, &descriptor[0]);
    } while (status == kStatus_CAAM_Again);

    if (kStatus_Success != status)
    {
        return status;
    }

    status = CAAM_Wait(base, handle, descriptor, kCAAM_Blocking);
#if defined(CAAM_OUT_INVALIDATE) && (CAAM_OUT_INVALIDATE > 0u)
    /* NOTE: DCACHE must be set to write-trough mode to safely invalidate cache!! */
    /* Invalidate unaligned data can cause memory corruption in write-back mode   */
    DCACHE_InvalidateByRange((uint32_t)data, dataSize);
#endif /* CAAM_OUT_INVALIDATE */
    return status;
}

/*!
 * brief Construct a encrypted  Black Blob
 *
 * This function constructs a job descriptor capable of performing
 * a encrypted blob operation on a plaintext object.
 *
 * param base CAAM peripheral base address
 * param handle Handle used for this request. Specifies jobRing.
 * param keyModifier Address of the random key modifier generated by RNG
 * param keyModifierSize Size of keyModifier buffer in bytes
 * param data Data adress
 * param dataSize Size of the buffer pointed by the data parameter
 * param[out] blob_data Output blob data adress
 * param blackKeyType  Type of black key see enum caam_desc_type_t for more info
 * return Status of the request
 */
status_t CAAM_BlackBlob_Encapsule(CAAM_Type *base,
                                  caam_handle_t *handle,
                                  const uint8_t *keyModifier,
                                  size_t keyModifierSize,
                                  const uint8_t *data,
                                  size_t dataSize,
                                  uint8_t *blob_data,
                                  caam_desc_type_t blackKeyType)
{
    status_t status = kStatus_Fail;

