Masmiseim36/nxpSDK/devices/MIMXRT1175/drivers/fsl_caam.c
    caam_desc_gen_enc_blob_t descriptor;
    size_t blob_size;

    /* output blob will have 32 bytes key blob in beginning and 16 bytes MAC identifier at end of data blob */
    blob_size = 32u + dataSize + 16u;

    /* Key modifier size must 8 bytes long when used Secure memory or 16bytes long when General memory is used*/
    if ((keyModifierSize != 8u) && (keyModifierSize != 16u))
    {
        return kStatus_InvalidArgument;
    }

    /* create job descriptor */
    BUILD_ASSURE(sizeof(templateBlob) <= sizeof(caam_desc_gen_enc_blob_t), caam_desc_gen_enc_blob_t);
    uint32_t descriptorSize = ARRAY_SIZE(templateBlob);

    (void)caam_memcpy(descriptor, templateBlob, sizeof(templateBlob));
    descriptor[0] |= (descriptorSize & DESC_SIZE_MASK);
#if defined(KEYBLOB_USE_SECURE_MEMORY)
    descriptor[1] |= 8u; // KEY command to Class 2 Context Register, 64bits RNG KEY.
#else
    descriptor[1] |= 16u;         // KEY command to Class 2 Context Register, 128bits RNG KEY.
#endif                                                 /* (KEYBLOB_USE_SECURE_MEMORY) */
    descriptor[2] = ADD_OFFSET((uint32_t)keyModifier); // Key modifier adress
    descriptor[3] |= dataSize;                         // SEQ IN PTR command to load plain data
    descriptor[4] = ADD_OFFSET((uint32_t)data);        // Plain data adress
    descriptor[5] |= blob_size;                        // Key blob adress
    descriptor[6] = ADD_OFFSET((uint32_t)blob_data);   // Key blob adress
#if defined(KEYBLOB_USE_SECURE_MEMORY)
    descriptor[7] |= (7UL << 24) | ((uint32_t)blackKeyType << 8) | DESC_BLACKKEY_NOMMEN |
                     SEC_MEM; // OPERATION:Encrypt black blob in secure memory
#else
    descriptor[7] |= (7UL << 24) | ((uint32_t)blackKeyType << 8) |
                     DESC_BLACKKEY_NOMMEN; // OPERATION:Encrypt black blob in normal memory
#endif /* (KEYBLOB_USE_SECURE_MEMORY) */

    // schedule the job and block wait for result
    do
    {
        status = caam_in_job_ring_add(base, handle->jobRing, &descriptor[0]);
    } while (status == kStatus_CAAM_Again);

    if (kStatus_Success != status)
    {
        return status;
    }

    status = CAAM_Wait(base, handle, descriptor, kCAAM_Blocking);
#if defined(CAAM_OUT_INVALIDATE) && (CAAM_OUT_INVALIDATE > 0u)
    /* NOTE: DCACHE must be set to write-trough mode to safely invalidate cache!! */
    /* Invalidate unaligned data can cause memory corruption in write-back mode   */
    DCACHE_InvalidateByRange((uint32_t)blob_data, blob_size);
#endif /* CAAM_OUT_INVALIDATE */
    return status;
}

/*! brief Construct a decrypted black blob
 *
 * This function constructs a job descriptor capable of performing
 * decrypting black blob.
 *
 * param base CAAM peripheral base address
 * param handle Handle used for this request. Specifies jobRing.
 * param keyModifier Address of the random key modifier generated by RNG
 * param keyModifierSize Size of keyModifier buffer in bytes
 * param blob_data Address of blob data
 * param[out] data Output data adress.
 * param dataSize Size of the buffer pointed by the data parameter in bytes
 * param blackKeyType   Type of black key see enum caam_desc_type_t for more info
 * return Status of the request
 */

status_t CAAM_BlackBlob_Decapsule(CAAM_Type *base,
                                  caam_handle_t *handle,
                                  const uint8_t *keyModifier,
                                  size_t keyModifierSize,
                                  const uint8_t *blob_data,
                                  uint8_t *data,
                                  size_t dataSize,
                                  caam_desc_type_t blackKeyType)
{
    status_t status = kStatus_Fail;

    caam_desc_gen_dep_blob_t descriptor;
    size_t blob_size;

    /* blob have 32 bytes key blob in beginning and 16 bytes MAC identifier at end of data blob */
    blob_size = 32u + dataSize + 16u;

    /* Key modifier size must 8 bytes long when used Secure memory or 16bytes long when General memory is used*/
    if ((keyModifierSize != 8u) && (keyModifierSize != 16u))
    {
        return kStatus_InvalidArgument;
    }

    /* create job descriptor */
    BUILD_ASSURE(sizeof(templateBlob) <= sizeof(caam_desc_gen_dep_blob_t), caam_desc_gen_dep_blob_t_size);
    uint32_t descriptorSize = ARRAY_SIZE(templateBlob);

    (void)caam_memcpy(descriptor, templateBlob, sizeof(templateBlob));
    descriptor[0] |= (descriptorSize & DESC_SIZE_MASK);
#if defined(KEYBLOB_USE_SECURE_MEMORY)
    descriptor[1] |= 8u; // KEY command to Class 2 Context Register, 64bits RNG KEY.
#else
    descriptor[1] |= 16u;                  // KEY command to Class 2 Context Register, 128bits RNG KEY.
#endif                                                 /* (KEYBLOB_USE_SECURE_MEMORY) */
    descriptor[2] = ADD_OFFSET((uint32_t)keyModifier); // Key modifier adress
    descriptor[3] |= blob_size;                        // SEQ IN PTR command to load blob data
    descriptor[4] = ADD_OFFSET((uint32_t)blob_data);   // Key blob adress
    descriptor[5] |= dataSize;
    descriptor[6] = ADD_OFFSET((uint32_t)data); // Plain data adress
#if defined(KEYBLOB_USE_SECURE_MEMORY)
    descriptor[7] |= (6UL << 24) | ((uint32_t)blackKeyType << 8) | DESC_BLACKKEY_NOMMEN |
                     SEC_MEM; // OPERATION:Decrypt black blob in secure memory
#else
    descriptor[7] |= (6UL << 24) | ((uint32_t)blackKeyType << 8) |
                     DESC_BLACKKEY_NOMMEN; // OPERATION:Decrypt black blob in normal memory
#endif /* (KEYBLOB_USE_SECURE_MEMORY) */
    // schedule the job and block wait for result
    do
    {
        status = caam_in_job_ring_add(base, handle->jobRing, &descriptor[0]);
    } while (status == kStatus_CAAM_Again);

    if (kStatus_Success != status)
    {
        return status;
    }

    status = CAAM_Wait(base, handle, descriptor, kCAAM_Blocking);
#if defined(CAAM_OUT_INVALIDATE) && (CAAM_OUT_INVALIDATE > 0u)
    /* NOTE: DCACHE must be set to write-trough mode to safely invalidate cache!! */
    /* Invalidate unaligned data can cause memory corruption in write-back mode   */
    DCACHE_InvalidateByRange((uint32_t)data, dataSize);
#endif /* CAAM_OUT_INVALIDATE */
    return status;
}

